In [3]:
import pandas as pd

file = pd.read_csv("../file_processing/job.csv", encoding="utf-8")
file

  name from  age  job
0  나은미   경기   23   학생
1  정다혜   서울   35   교사
2  이은형   충남   29  공무원
3  김은미   강원   31  회사원
4  최성주   제주   35  매니저
5  오달수   강원   55   배우

In [4]:
# 불러온 job.csv 파일을 데이터프레임으로 가져와 age가 30대인 데이터를 조회
file[(file['age'] >= 30) & (file['age'] < 40)]

  name from  age  job
1  정다혜   서울   35   교사
3  김은미   강원   31  회사원
4  최성주   제주   35  매니저